class Texts:
	start_state_text = '''<b>Портфолио бот Даниила Брежнева.</b>
Нижне представлены следующие разделы:

<b>🟢 Мои биография и мой стек

🟢 Резюме

🟢 Мои Pet-проекты</b>
	'''

	bio_button_text = 'Обо мне'
	bio_state_text = '''
Я студент факультета Математика и Компьютерные науки. На данный момент мне 20 лет.
Программированием занимаюсь с 7-го класса. Начинал с PascalABC.NET(Куда же без него). В 8-10м классе пробовал себя в Web разработке.' \
Писал простенькие сайты на HTML+CSS+JS. Пробовал решать задачи на CodeForces. В 10м(17 лет)
классе начал писать на языке Swift, разрабатывал свои простенькие игрушки под iPhone.
		\n
В начале одиннадцатого класса начал писать на Python3, заинтересовался разработкой ботов и \
нейронными сетями. С нейронками пошло не очень, но с ботами получилось.
Писал ботов для telegram, Discord. Написал свой аналог "Анонимного чата", админ боты в телеграмм и discord каналы. \
Делал объединение чата в дискорде с телеграммом. Какое-то время работал младшим разработчиком telegram бота в стартапе. \
		\n
Есть свой <a href="https://t.me/discord_py_ru">небольшой чат</a> по разработке дискорд ботов на Python
		\n
Параллельно учебе в вузе преподавал(и до сих пор преподаю) школьникам информатику к ЕГЭ. \
С нуля учу их программировать и тому подобное.
		\n
<b>Кратко. мой стек</b>:
Python3, Django, SQL, GitHub, aiogram, discord-py, json
		\n
<b>Понимаю и могу что-то накидать</b>:
HTMLL, CSS, могу читать не сложный JS и C++
		'''

	about_project_button_text = 'Резюме'
	about_project_text = 'Здесь будет мое резюме'

	all_projects_button_text = 'Мои проекты'
	all_projects_text = 'ALL PROJECTS HERE:'

	projects_button_text = ['🌍 Wiki Finder Bot 📜', '🇬🇧 Easy English 🔬', 'project_2', 'project_3']
	projects_description_texts = ['🇬🇧WiKi Finder Bot\n'\
								  'Инлайн бот для поиска статей по Википедии\n\n'\
								  '@wiki_finder_bot\n\n'\
								  'https://github.com/franken3/wiki-telegram-inline-bot'
								  ,
								  'Easy English', 'project_1 - Первы.. Второй проеквт!',
								  'project_3 - 3й']
	back_button_text = 'BACK'
